Revit 2027 API
MechanicalEquipmentSet.Remove Method
 Removes member element ids from the mechanical equipment set.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Remove(
	ISet<ElementId> elemIds
)
Public Sub Remove (
	elemIds As ISet(Of ElementId)
)
public:
void Remove(
	ISet<ElementId^>^ elemIds
)
member Remove :
        elemIds : ISet<ElementId> -> unit
Parameters
elemIds ISet<ElementId>
 Element ids to be removed from the mechanical equipment set.
Exceptions
Exception | Condition
ArgumentException |  One or more element ids was not permitted to be removed from the mechanical equipment set. All elements should be a member of the mechanical equipment set.
ArgumentNullException |  A non-optional argument was null
Remarks
 If all the members are removed, the instance of the mechanical equipment set is automatically deleted.
See Also
Reference
MechanicalEquipmentSet Class
Autodesk.Revit.DB.Mechanical Namespace